<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"209747db9d5cb23d005c84cbf21bc95bec41e88d0a1757edd95b9de35c75b444","plan_job_ref":"Job Pull Request Checks #4831 at https://github.com/GSA-TTS/FAC/actions/runs/15570694046","plan_out_hash":"afba1201af14fcaed70ef81f6533adac311cd74d13c45e12f05e96277dd52140","plan_hash":"5a18a4cb799efdd9b934943da3a02df04c612f8cfbcc2d467a32ef08aa7c4592","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 7 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.dev.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
!~          {
!~              source_app      = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.dev.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.dev.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:22:42Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:a91de4d279315089f5466d4e5a47adb4ce39d7f7108f2e466cd7d46fc4849996" -> "ghcr.io/gsa-tts/fac/clamav@sha256:10d29d182a906484cd235672fb88fad06c68959eeb315afc50dc4635da3180aa"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-dev"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-dev.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-05-30T17:30:02Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.dev.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-06-05T16:07:24Z" -> (known after apply)
        }
    }

  # module.dev.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:22:42Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:a91de4d279315089f5466d4e5a47adb4ce39d7f7108f2e466cd7d46fc4849996" -> "ghcr.io/gsa-tts/fac/clamav@sha256:10d29d182a906484cd235672fb88fad06c68959eeb315afc50dc4635da3180aa"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-dev-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-dev-fs.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-05-30T17:32:36Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.dev.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
-               app_process_type = "web" -> null
-               id               = "3253c01b-5425-4c19-822d-c60fe6ee7ed4" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "877bbc1f-e036-4a96-b7a3-70cff8c35c3c"
!~      updated_at   = "2025-04-21T18:47:15Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.dev.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> null
-               app_process_type = "web" -> null
-               id               = "70a720da-01ac-403d-927d-c41045c43299" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "b5be537b-5186-4d4f-9aa6-b094b7fcb694"
!~      updated_at   = "2025-05-30T17:32:38Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 7 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4831](https://github.com/GSA-TTS/FAC/actions/runs/15570694046)